ХМНПФ_Общее/InformationRegisters/ХМ_Кейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХМ_Кейсы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>RM_Задача</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/хм_МСФО_ОПС_МаппингДП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>хм_МСФО_ОПС_МаппингДП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоэффициентРезервыПриход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>payment_type_cd</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоэффициентНачисленияРасход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>flow_type_cd</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИсточникПотока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоэффициентВыплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоэффициентРезервыРасход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоэффициентНачисленияПриход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗнакСуммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИсточникПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриемникПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыВыплат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидРучнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ВидыРучныхОперацийНПФ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/ХМ_ЗагрузкаКаспер_ТипЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХМ_ЗагрузкаКаспер_ТипЗагрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗагрузкаПоПравиламОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗагрузкаПоЗапросу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗагрузкаСКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПропуститьЗагрузку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцедурнаяЗагрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УниверсальнаяЗагрузкаВРегистр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/CommonModules/хм_МеханизмыСверкиСервер/Ext/Module.bsl
// +ХМНПФ 27.08.2025 КопыткоАА // http://redmine.npf.com/issues/4564
Функция ОбработатьВыделенноеНаСервере(СтрокаКоманда,Верх,Низ,Лево,Право, ДополнительныеПараметры, ДанныеРасшифровки, АдресРезультата) Экспорт
	
	ДанныеВозврата = Новый Массив; 
	ВозвращатьСтроками = Ложь;
	Если ДополнительныеПараметры.Свойство("ВозвращатьСтроками") Тогда
		ВозвращатьСтроками = Истина;
	КонецЕсли;
	
	МассивРассшифровки = Новый Массив();
	Если ЭтоАдресВременногоХранилища(ДанныеРасшифровки) Тогда
		ДанныеОтчета = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);  
	КонецЕсли;
	Если ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Иначе
		Результат = АдресРезультата; 
	КонецЕсли;
	ТипРезультата = ТипЗнч(Результат);
	Для ИндексСтрока = Верх По Низ Цикл
		Если ВозвращатьСтроками = Истина Тогда
			ДанныеВозвратаСтроки = Новый Соответствие();
		КонецЕсли;
		Для ИндексКолонка = Лево По Право Цикл
			Если ТипРезультата = ТИП("ТабличныйДокумент") Тогда
				Попытка
					Ячейка = Результат.Область("R" + Формат(ИндексСтрока, "ЧГ=0") + "C" + Формат(ИндексКолонка, "ЧГ=0"));
					Если Ячейка.Расшифровка = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					ПоляРасшифровки = ДанныеОтчета.Элементы.Получить(Ячейка.Расшифровка).ПолучитьПоля();
					Если ПоляРасшифровки.Количество() = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					ПолеРасшифровки = ПоляРасшифровки[0];
					Если ПолеРасшифровки = Неопределено Тогда
						Продолжить;						
					КонецЕсли;     
					
					Если СтрокаКоманда = "УточнитьНастройкиМСФО" ИЛИ
						((ДополнительныеПараметры.Свойство("ИмяПоля") = ЛОЖЬ ИЛИ ПолеРасшифровки.Поле = ДополнительныеПараметры.ИмяПоля)
						И (ДополнительныеПараметры.Свойство("ПоляДляУточнения") = ЛОЖЬ ИЛИ ДополнительныеПараметры.ПоляДляУточнения.Свойство(ПолеРасшифровки.Поле))) Тогда //и ПолеРасшифровки.Поле = "ТекСостояние.Регистратор" Тогда
						
						ОбработатьЗначениеРасшифровки(СтрокаКоманда, ПолеРасшифровки.Значение, ПолеРасшифровки.Поле , Ячейка, ВозвращатьСтроками, ДанныеВозврата, ДанныеВозвратаСтроки);
						
					КонецЕсли; 
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			ИначеЕсли ТипРезультата = ТИП("Структура")ИЛИ ТипРезультата = ТИП("ДанныеФормыСтруктура") Тогда 
				Если ДополнительныеПараметры.Свойство("ИмяПоля") Тогда 
					ОбработатьЗначениеРасшифровки(СтрокаКоманда, Результат[ДополнительныеПараметры.ИмяПоля], ДополнительныеПараметры.ИмяПоля , Неопределено, ВозвращатьСтроками, ДанныеВозврата, ДанныеВозвратаСтроки);
                ИначеЕсли ДополнительныеПараметры.Свойство("ПоляДляУточнения") Тогда
					Для Каждого ПолеДляУточнения Из ДополнительныеПараметры.ПоляДляУточнения Цикл 
						ОбработатьЗначениеРасшифровки(СтрокаКоманда, Результат[ПолеДляУточнения.Ключ], ПолеДляУточнения.Ключ , Неопределено, ВозвращатьСтроками, ДанныеВозврата, ДанныеВозвратаСтроки);
					КонецЦикла;
				КонецЕсли;						
			КонецЕсли;
			
		КонецЦикла;
		Если ВозвращатьСтроками = Истина Тогда
			ДанныеВозврата.Добавить(ДанныеВозвратаСтроки);	
		КонецЕсли;
	КонецЦикла;      
	
	Если СтрокаКоманда = "ПометитьИПерегрузитьИзКаспер" Тогда
		Для каждого Регистратор Из ДанныеВозврата Цикл
			МассивРегистраторов = Новый Массив();
			Если МассивРегистраторов.Найти(Регистратор) = Неопределено Тогда
				МассивРегистраторов.Добавить(Регистратор);
				ОбъектРегистратор = Регистратор.ПолучитьОбъект();
				ОбъектРегистратор.РучнаяКорректировка = Ложь;
				ОбъектРегистратор.ПометкаУдаления = Истина;
				ОбъектРегистратор.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если СтрокаКоманда = "ПерегрузитьИзКаспер" ИЛИ СтрокаКоманда = "ПометитьИПерегрузитьИзКаспер" Тогда                          
		ЗагрузкаСписком = ?(СтрокаКоманда = "ПерегрузитьИзКаспер",",ЗагрузкаСписком","");
		ХМ_ЗагрузкаТЗ_V02_ВызовСервера.ИнтерактивнаяЗагрузкаДокументов(ДанныеВозврата,Новый Структура("ОбновитьЗагрузку,ПотоковаяЗагрузка"+ЗагрузкаСписком),Новый Структура("Статус","НП"));
		ХМ_ЗагрузкаТЗ_V02_ВызовСервера.ИнтерактивнаяЗагрузкаДокументов(ДанныеВозврата,Новый Структура("ОбновитьЗагрузку,ПотоковаяЗагрузка"+ЗагрузкаСписком),Новый Структура("Статус","НЕ"));
	КонецЕсли;

	Возврат ДанныеВозврата;
КонецФункции 

Процедура ДобавитьСчетаВИсключениеНаСервере(ТребуемоеУтонение,ДополнительныеПараметры) Экспорт
	Для каждого СтруктураРасшифровки Из ДополнительныеПараметры.МассивРассшифровки Цикл
      	Попытка
			МенеджерЗаписи = РегистрыСведений.ХМ_Кейсы.СоздатьМенеджерЗаписи();	
			МенеджерЗаписи.НомерСчета = СтруктураРасшифровки.Получить("НомерСчета");
			МенеджерЗаписи.RM_Задача = ТребуемоеУтонение.RM_Задача;

			МенеджерЗаписи.Прочитать();
			Если Не МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.НомерСчета = СтруктураРасшифровки.Получить("НомерСчета");
				МенеджерЗаписи.RM_Задача = ТребуемоеУтонение.RM_Задача;
			КонецЕсли;	

			МенеджерЗаписи.Описание = ТребуемоеУтонение.Описание;
			МенеджерЗаписи.Документ = ТребуемоеУтонение.Документ;
			// записываем менеджер записи
			МенеджерЗаписи.Записать();			
		Исключение
			Сообщить("Что то пошло не так");
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработатьЗначениеРасшифровки(СтрокаКоманда, ЗначенниеРасшифровки, ИмяПоля, Ячейка, 
	ВозвращатьСтроками, ДанныеВозврата, ДанныеСтроки)
	
	Если Не ЗначениеЗаполнено(ЗначенниеРасшифровки) И ЗначениеЗаполнено(Ячейка) И НЕ СтрокаКоманда = "УточнитьНастройкиМСФО" Тогда
		ЗначенниеРасшифровки = Ячейка.Текст;
	КонецЕсли;
	
	Если Не ВозвращатьСтроками Тогда
		ДанныеВозврата.Добавить(ЗначенниеРасшифровки);
	Иначе
		ДанныеСтроки.Вставить(ИмяПоля, ЗначенниеРасшифровки);
	КонецЕсли;
	
	Если СтрокаКоманда = "ПровестиВыделенные" Тогда
		Попытка
		    ЗначенниеРасшифровки.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);	
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;		
	КонецЕсли;     
КонецПроцедуры

Процедура УточнитьНастройкиМСФОНаСервере(ТребуемоеУтонение,ДополнительныеПараметры) Экспорт
	Для каждого СтруктураРасшифровки Из ДополнительныеПараметры.МассивРассшифровки Цикл
		Префикс = "МСФО.";
		ДополнительныеПараметры.Свойство("Префикс",Префикс);
		Если СтруктураРасшифровки.Получить(Префикс+ "ТипДокумента") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
      	Попытка
			МенеджерЗаписи = РегистрыСведений.хм_МСФО_ОПС_МаппингДП.СоздатьМенеджерЗаписи();
			Если НЕ СтруктураРасшифровки.Получить(Префикс+ "Документ") = Неопределено И НЕ СтруктураРасшифровки.Получить(Префикс+ "Документ").Пустая() Тогда 
				МенеджерЗаписи.ТипДокумента = СтруктураРасшифровки.Получить(Префикс+ "Документ");
			Иначе	
				МенеджерЗаписи.ТипДокумента = Новый(СтруктураРасшифровки.Получить(Префикс+ "ТипДокумента"));				
			КонецЕсли;
			МенеджерЗаписи.ТипВыплаты = СтруктураРасшифровки.Получить(Префикс+ "ТипВыплаты");
			МенеджерЗаписи.ТипРезерва = СтруктураРасшифровки.Получить(Префикс+ "ТипРезерва");
			МенеджерЗаписи.ВидРучнойОперации = СтруктураРасшифровки.Получить(Префикс+ "ВидРучнойОперации");
			МенеджерЗаписи.ВидДеятельности = СтруктураРасшифровки.Получить(Префикс+ "ВидДеятельности");
		
			МенеджерЗаписи.Прочитать();
			Если Не МенеджерЗаписи.Выбран() Тогда
				Если НЕ СтруктураРасшифровки.Получить(Префикс+ "Документ") = Неопределено И НЕ СтруктураРасшифровки.Получить(Префикс+ "Документ").Пустая() Тогда 
					МенеджерЗаписи.ТипДокумента = СтруктураРасшифровки.Получить(Префикс+ "Документ");
				Иначе	
					МенеджерЗаписи.ТипДокумента = Новый(СтруктураРасшифровки.Получить(Префикс+ "ТипДокумента"));				
				КонецЕсли;
				МенеджерЗаписи.ТипВыплаты = СтруктураРасшифровки.Получить(Префикс+ "ТипВыплаты");
				МенеджерЗаписи.ВидРучнойОперации = СтруктураРасшифровки.Получить(Префикс+ "ВидРучнойОперации");
				МенеджерЗаписи.ВидДеятельности = СтруктураРасшифровки.Получить(Префикс+ "ВидДеятельности");
				Если ДополнительныеПараметры.Свойство("УточнятьПустойТипРезерва") Тогда
					МенеджерЗаписи.ТипРезерва = ПредопределенноеЗначение("Перечисление.уп_ТипыРезервовОПС.ПустаяСсылка");
					МенеджерЗаписи.Прочитать();
					Если Не МенеджерЗаписи.Выбран() Тогда
						Сообщить("Что то пошло не так");                                   
						Продолжить;
					КонецЕсли;
				Иначе
					МенеджерЗаписи.ТипРезерва = СтруктураРасшифровки.Получить(Префикс+ "ТипРезерва");
				КонецЕсли;
			КонецЕсли;	

			Если ДополнительныеПараметры.Свойство("ПоляУточнения") Тогда
				Для каждого Ключ ИЗ ДополнительныеПараметры.ПоляУточнения Цикл
					МенеджерЗаписи[Ключ.Ключ] = ТребуемоеУтонение[Ключ.Ключ];
					Если Ключ.Ключ = "ИсточникПотока" Тогда
						МенеджерЗаписи.КоэффициентРезервыПриход = ТребуемоеУтонение.КоэффициентРезервыПриход;
						МенеджерЗаписи.КоэффициентРезервыРасход = ТребуемоеУтонение.КоэффициентРезервыРасход;
						МенеджерЗаписи.КоэффициентНачисленияРасход = ТребуемоеУтонение.КоэффициентНачисленияРасход;
						МенеджерЗаписи.КоэффициентНачисленияПриход = ТребуемоеУтонение.КоэффициентНачисленияПриход;
						МенеджерЗаписи.КоэффициентВыплаты = ТребуемоеУтонение.КоэффициентВыплаты;
					КонецЕсли;
				КонецЦикла;
			Иначе
				МенеджерЗаписи.flow_type_cd = ТребуемоеУтонение.flow_type_cd;
				МенеджерЗаписи.payment_type_cd = ТребуемоеУтонение.payment_type_cd;
				МенеджерЗаписи.ТипПлатежа = ТребуемоеУтонение.ТипПлатежа;       	
				МенеджерЗаписи.ИсточникПотока = ТребуемоеУтонение.ИсточникПотока;
				МенеджерЗаписи.Статус = ТребуемоеУтонение.Статус;
				МенеджерЗаписи.ИсточникПлатежа = ТребуемоеУтонение.ИсточникПлатежа;
				МенеджерЗаписи.ПриемникПлатежа = ТребуемоеУтонение.ПриемникПлатежа;
				МенеджерЗаписи.КоэффициентРезервыПриход = ТребуемоеУтонение.КоэффициентРезервыПриход;
				МенеджерЗаписи.КоэффициентРезервыРасход = ТребуемоеУтонение.КоэффициентРезервыРасход;
				МенеджерЗаписи.КоэффициентНачисленияРасход = ТребуемоеУтонение.КоэффициентНачисленияРасход;
				МенеджерЗаписи.КоэффициентНачисленияПриход = ТребуемоеУтонение.КоэффициентНачисленияПриход;
				МенеджерЗаписи.КоэффициентВыплаты = ТребуемоеУтонение.КоэффициентВыплаты;
			КонецЕсли;
			
				
			// записываем менеджер записи
			МенеджерЗаписи.Записать();			
		Исключение
			Сообщить("Что то пошло не так");
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры 

// ++ КопыткоАА
//Процедура не работает как надо из-за передачи формы на сервер скорее всего, пока оставил, может всеже нужна
Процедура СоздатьЭлементыФормыПользовательскихНастроекНаСервере(Форма, ДляСписка = Ложь) Экспорт  
	Если ДляСписка = Ложь Тогда
		 Форма.СоздатьЭлементыФормыПользовательскихНастроек();
	 Иначе
		 Форма.Элементы.Список.СоздатьЭлементыФормыПользовательскихНастроек();	
	КонецЕсли;
КонецПроцедуры

#Область ЗагрузкаКасперV4_0
	
Функция Каспер_ЗагрузитьВРегистрНаСервере(ПараметрыЗагрузки,ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Не ПараметрыЗагрузки.Свойство("ИмяРегистра") Тогда
		ТекстСообщения = НСтр("ru = 'Не передан обязательный параметр ""ИмяРегистра""'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;

	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура();
	КонецЕсли;

	Если Не ПараметрыЗагрузки.Свойство("ЗагрузитьДоКонцаПериода") Тогда
		ПараметрыЗагрузки.Вставить("ЗагрузитьДоКонцаПериода",Ложь);
	КонецЕсли;	
		
	Если ПараметрыЗагрузки.ЗагрузитьДоКонцаПериода = Истина Тогда
		РезультатЗагрузки = Истина;
		ПараметрыЗагрузки.ЗагрузитьДоКонцаПериода = Ложь;
		ДатаЗагрузки = ПараметрыЗагрузки.ДатаИзменений;
		
		Пока ДатаЗагрузки < ПараметрыЗагрузки.КонецПериода Цикл
			
			ПараметрыЗагрузки.ДатаИзменений = ДатаЗагрузки;
			РезультатЗагрузки = Мин(Каспер_ЗагрузитьВРегистрНаСервере(ПараметрыЗагрузки,ДополнительныеПараметры),РезультатЗагрузки); 
			ДатаЗагрузки = ДобавитьМесяц(ДатаЗагрузки,1);
			
		КонецЦикла;
		Возврат РезультатЗагрузки;               
	КонецЕсли;
	
	ТД = ТекущаяДата();

	
// 	Если ПараметрыЗагрузки.Свойство("НачалоПериода") Тогда
//		ПараметрыЗагрузки.Вставить("ДатаИзменений",ПараметрыЗагрузки.НачалоПериода);
//	КонецЕсли;


//	Если ПараметрыЗагрузки.Свойство("ТЗ_Каспер") Тогда
//		СтрокаЗагрузкиКаспер.Вставить("ТЗ",ПараметрыЗагрузки.ТЗ_Каспер);	
//	КонецЕсли;

	СтрокаТаблицы = Новый Структура();
	СтрокаТаблицы.Вставить("ИмяТаблицы", ПараметрыЗагрузки.ИмяРегистра);
	СтрокаТаблицы.Вставить("ПредставлениеТаблицы", ПараметрыЗагрузки.ИмяРегистра + "(" + ПараметрыЗагрузки.PF_ID + ")");
	СтрокаТаблицы.Вставить("ТипЗагрузкиКаспер", Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаПоЗапросу);
	СтрокаТаблицы.Вставить("ТипЗагрузкиКлиент", Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаПоЗапросу);
	СтрокаТаблицы.Вставить("ТипЗагрузкиСервер", Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.УниверсальнаяЗагрузкаВРегистр);
	
 	Если ПараметрыЗагрузки.Свойство("НачалоПериода") Тогда
		ПараметрыЗагрузки.Вставить("ДатаИзменений",ПараметрыЗагрузки.НачалоПериода);
	КонецЕсли;

	СтрокаЗагрузкиКаспер = Новый Структура("Запрос");
	ПараметрыЗагрузки.Свойство("ТекстЗапроса",СтрокаЗагрузкиКаспер.Запрос);

	Если ПараметрыЗагрузки.Свойство("ТЗ_Каспер") Тогда
		СтрокаЗагрузкиКаспер.Вставить("ТЗ",ПараметрыЗагрузки.ТЗ_Каспер);	
	КонецЕсли;
	
	ПравилаЗагрузкиКаспер = Новый Структура("ТЗ_Каспер",СтрокаЗагрузкиКаспер);
	СтрокаЗагрузкиКлиент = Новый Структура("Запрос");
	ПараметрыЗагрузки.Свойство("ТекстЗапросаМаппинг",СтрокаЗагрузкиКлиент.Запрос);

	ПравилаЗагрузкиКлиент = Новый Структура("ТЗ_Каспер",СтрокаЗагрузкиКлиент);
	
	ПравилаЗагрузкиСервер = Новый Структура();                           
	
	ВыполнятьЗагрузкуИзМетодаРегистра(СтрокаТаблицы, ПравилаЗагрузкиСервер);
	
	ЛогОшибок = Новый Массив();
	
	Если ПараметрыЗагрузки.Свойство("ПоляОтбораЗаписей") Тогда
		ДополнительныеПараметры.Вставить("ПоляОтбораЗаписей",ПараметрыЗагрузки.ПоляОтбораЗаписей);
	КонецЕсли;

	РезультатЗагрузки = ХМ_ЗагрузкаТЗ_Клиент.ЗагрузитьДокумент(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ПравилаЗагрузкиКлиент, ПравилаЗагрузкиСервер, ДополнительныеПараметры, ЛогОшибок);
	
	Сообщить(ТекущаяДата() - ТД);
	Если ДополнительныеПараметры.Свойство("СообщитьЛогОшибок") Тогда
		СообщитьЛогОшибок(ЛогОшибок);	
	КонецЕсли;
	Возврат РезультатЗагрузки.Результат;
КонецФункции

Процедура СообщитьЛогОшибок(ЛогОшибок)
	Если ТипЗнч(ЛогОшибок) = Тип("Массив") Тогда
		Для каждого Лог Из ЛогОшибок Цикл
			СообщитьЛогОшибок(Лог);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ЛогОшибок) = Тип("Строка") Тогда
		Сообщить(ЛогОшибок);
	ИначеЕсли ТипЗнч(ЛогОшибок) = Тип("Структура") Тогда
		Для каждого Лог Из ЛогОшибок Цикл
			Сообщить(Лог.Ключ);
			СообщитьЛогОшибок(Лог.Значение);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ЛогОшибок) = Тип("ТаблицаЗначений") Тогда
		Для каждого СтрокаЛогОшибок Из ЛогОшибок Цикл
			СтрокаСообщить = "";
			Для каждого Колонка Из ЛогОшибок.Колонки Цикл
				СтрокаСообщить = СтрокаСообщить+СтрокаЛогОшибок[Колонка.имя] +"	";
			КонецЦикла;
			Сообщить(СтрокаСообщить);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПоляОтбораЗаписей(СтрокаТаблицы, ПараметрыЗагрузки = Неопределено) Экспорт
	
	Перем ИмяРегистра, PF_ID, НачалоПериода; 
	
	Если ПараметрыЗагрузки = Неопределено Тогда
		ПараметрыЗагрузки = Новый Структура();
	КонецЕсли;
	
	ПоляОтбораЗаписей = Новый Структура();
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы,"ИмяТаблицы") Тогда 
		ИмяРегистра = СтрокаТаблицы.ИмяТаблицы;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы,"ИмяРегистра") Тогда
		ИмяРегистра = СтрокаТаблицы.ИмяРегистра;	
	КонецЕсли;
	
	//Если Не СтрокаТаблицы.Свойство("ИмяТаблицы",ИмяРегистра) Тогда
	//	СтрокаТаблицы.Свойство("ИмяРегистра",ИмяРегистра);
	//КонецЕсли;
	
	ПолеПериода = ПолучитьПолеПериода(ИмяРегистра);
	
	Если Не ПараметрыЗагрузки.Свойство("ДатаИзменений",НачалоПериода) Тогда  
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы,"НачалоПериода") Тогда
			НачалоПериода = СтрокаТаблицы.НачалоПериода;
		КонецЕсли;
		//СтрокаТаблицы.Свойство("НачалоПериода",НачалоПериода);
	КонецЕсли;

	Если ЗначениеЗаполнено(ПолеПериода) И ЗначениеЗаполнено(НачалоПериода) Тогда
		ПоляОтбораЗаписей.Вставить(ПолеПериода,НачалоПериода);	
	КонецЕсли;

	Если Не ПараметрыЗагрузки.Свойство("PF_ID",PF_ID) Тогда 
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы,"PF_ID") Тогда
			PF_ID = СтрокаТаблицы.PF_ID;
		КонецЕсли;
		//СтрокаТаблицы.Свойство("PF_ID",PF_ID);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(PF_ID) Тогда
		ПоляОтбораЗаписей.Вставить("PF_ID",PF_ID);	
	КонецЕсли;	
	
	Возврат ПоляОтбораЗаписей;

КонецФункции


Функция ПолучитьОписаниеПроцедурЗагрузки() Экспорт
	ОписаниеПроцедурЗагрузки = Новый Структура();
	ОписаниеПроцедурЗагрузки.Вставить("KU_V_HM_OPER_VED", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", "OPER_DATE", Истина, Ложь));
	ОписаниеПроцедурЗагрузки.Вставить("KU_V_HM_OPER_DT_NN", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", "OPER_BEGIN", Истина, Ложь));
	ОписаниеПроцедурЗагрузки.Вставить("KU_НачисленияВыплаты", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", "D_DATE", Истина, Ложь));
	ОписаниеПроцедурЗагрузки.Вставить("KU_НачисленнияНДФЛ", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", "D_DATE", Истина, Ложь));
	ОписаниеПроцедурЗагрузки.Вставить("ПрименениеСтандартныхВычетовПоНДФЛВторичный", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", "ДатаНачала", Ложь, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("СтандартныеВычетыПоНДФЛВторичный", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", "ДатаНачала", Ложь, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("KU_ДолгПоНачислениям", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", "OPER_DATE", Истина, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("K_V_HM_SALDO", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", "OPER_DATE", Ложь, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("ХМ_СчетчикНачислений", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", "OPER_DATE", Истина, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("KU_ДолгПоЗадолженности", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", "OPER_DATE", Истина, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("KU_Операции", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", "OPER_MONTH", Истина, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("KU_OTHER", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", "VED_PERIOD", Истина, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("KU_V_HM_OPER_DEBT", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", "PF_ID", Ложь, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("KU_DTI_FOND_ALIMENT", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", "OPER_DATE", Ложь, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("KU_CRI_FOND_ALIMENT", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", "OPER_DATE", Ложь, Ложь));
	ОписаниеПроцедурЗагрузки.Вставить("K_V_HM_PF_GET_ALL", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", "OPER_BEGIN", Ложь, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("K_V_HM_STATUS_1C", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", "OPER_BEGIN", Ложь, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("хм_НПО_258", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", "REP_DATE", Ложь, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("хм_НПО_258_Флаг", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", "REP_DATE", Ложь, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("K_V_HM_PF_PENS_VAL", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", Неопределено, Ложь, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("K_V_HM_PF_FIRST_PENS", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", Неопределено, Ложь, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("K_V_HM_MAP_PAY_PERIODICITY", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", Неопределено, Ложь, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("K_V_HM_PENS_SUB_MAP", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", Неопределено, Ложь, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("K_V_HM_DTI_SUM", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", Неопределено, Ложь, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("K_V_HM_PENS_DELIVERY", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", Неопределено, Ложь, Истина));
	ОписаниеПроцедурЗагрузки.Вставить("K_V_HM_ACTOR_SUB", Новый Структура("ПолеПериода,ПериодВЗапросе,ЗагрузкаНаПрямую", Неопределено, Ложь, Истина));

	Возврат ОписаниеПроцедурЗагрузки;
КонецФункции

Функция ПолучитьПолеПериода(ИмяРегистра) Экспорт
	ПолеПериода = Неопределено;
	ОписаниеПроцедуры = Неопределено;
	ОписаниеПроцедурЗагрузки =  ПолучитьОписаниеПроцедурЗагрузки();
	Если ОписаниеПроцедурЗагрузки.Свойство(ИмяРегистра,ОписаниеПроцедуры) = Истина Тогда
		ОписаниеПроцедуры.Свойство("ПолеПериода",ПолеПериода);
	КонецЕсли;

	Если ПолеПериода = Неопределено Тогда
		Если ПериодВЗапросе(ИмяРегистра) Тогда
			ТекстСообщения = НСтр("ru = 'Не обнаружено поле периода'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
		КонецЕсли;		
	КонецЕсли;
	Возврат ПолеПериода;
КонецФункции

Функция ЗагрузкаНаПрямую(ИмяРегистра) Экспорт
	
	ЗагрузкаНаПрямую = Ложь; // По умолчанию
	ОписаниеПроцедуры = Неопределено;
	ОписаниеПроцедурЗагрузки = ПолучитьОписаниеПроцедурЗагрузки();
	
	Если ОписаниеПроцедурЗагрузки.Свойство(ИмяРегистра, ОписаниеПроцедуры) = Истина Тогда
		ОписаниеПроцедуры.Свойство("ЗагрузкаНаПрямую", ЗагрузкаНаПрямую);
	КонецЕсли;
	
	Возврат ЗагрузкаНаПрямую;
	
КонецФункции

Функция ПериодВЗапросе(ИмяРегистра) Экспорт
	
	ПериодВЗапросе = Истина; // По умолчанию
	ОписаниеПроцедуры = Неопределено;
	ОписаниеПроцедурЗагрузки = ПолучитьОписаниеПроцедурЗагрузки();
	
	Если ОписаниеПроцедурЗагрузки.Свойство(ИмяРегистра, ОписаниеПроцедуры) = Истина Тогда
		ОписаниеПроцедуры.Свойство("ПериодВЗапросе", ПериодВЗапросе);
	КонецЕсли;
	
	Возврат ПериодВЗапросе;
	
КонецФункции

Процедура ВыполнятьЗагрузкуИзМетодаРегистра(СтрокаТаблицы, ПравилаЗагрузкиСервер)
	
	Если СтрокаТаблицы.ИмяТаблицы = "KU_ДолгПоНачислениям" Тогда
		ИмяПроцедуры = "хм_МеханизмыСверкиСерверПереопределяемый.KU_ДолгПоНачислениям_ЗагрузитьВРегистр";
	ИначеЕсли СтрокаТаблицы.ИмяТаблицы = "KU_ДолгПоЗадолженности" Тогда
		ИмяПроцедуры = "хм_МеханизмыСверкиСерверПереопределяемый.KU_ДолгПоЗадолженности_ЗагрузитьВРегистр";
	Иначе
		Возврат;
	КонецЕсли;
	
	СтрокаТаблицы.ТипЗагрузкиСервер = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ПроцедурнаяЗагрузка;
	
	ПравилаЗагрузкиСервер.Вставить("ТЗ_Каспер",Новый Структура("Имя,ИмяПроцедуры,ИмяТЗ,ОчиститьДвижения,ДополнитьДвижения,ОперацияНПО","ТЗ_Каспер",ИмяПроцедуры,"ТЗ_Каспер",Ложь,Ложь,Неопределено));

КонецПроцедуры

Функция ПолучитьПроцедурыЗагрузки() Экспорт;

	МассивПроцедур = Новый Массив();
    ОписаниеПроцедур = ПолучитьОписаниеПроцедурЗагрузки();
	Для каждого Описание Из ОписаниеПроцедур Цикл
		МассивПроцедур.Добавить(Описание.Ключ);
	КонецЦикла;

	Возврат МассивПроцедур;
КонецФункции





#КонецОбласти 

#Область ЗагрузкаСКД

Функция ПодготовитьПараметрыЗагрузкиСреза(ПараметрыКоманды, ОперацияНПО, ПараметрыЗаполнения, ПараметрыДанных = Неопределено, ПараметрыОтбора = Неопределено, ДополнительныеПараметры = Неопределено)

	ПодготовленныеПараметры = Новый Структура("СтрокаТаблицы,ПараметрыЗагрузки,ПравилаЗагрузкиКаспер,ПравилаЗагрузкиКлиент,ПравилаЗагрузкиСервер,ДополнительныеПараметры,ЛогОшибок");
	СтрокаТаблицы = Новый Структура();
	СтрокаТаблицы.Вставить("ПредставлениеТаблицы",ПараметрыКоманды.ИмяКоманды);
	СтрокаТаблицы.Вставить("ИмяТаблицы",ПараметрыКоманды.ИмяКоманды);
	СтрокаТаблицы.Вставить("ТипОбъекта",10);
	СтрокаТаблицы.Вставить("ТипЗагрузкиКаспер",Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ПропуститьЗагрузку);
	СтрокаТаблицы.Вставить("ТипЗагрузкиКлиент",Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаСКД);
	СтрокаТаблицы.Вставить("ТипЗагрузкиСервер",Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ПроцедурнаяЗагрузка);
	ПодготовленныеПараметры.Вставить("СтрокаТаблицы",СтрокаТаблицы);
	
	ПараметрыЗагрузки = Новый Структура();
	Если НЕ ПараметрыДанных = Неопределено Тогда
		Для Каждого ПараметрДанных Из ПараметрыДанных Цикл
			ПараметрыЗагрузки.Вставить(ПараметрДанных.Ключ,ПараметрДанных.Значение);
		КонецЦикла;		
	КонецЕсли;
	Если НЕ ПараметрыОтбора = Неопределено Тогда
		Для Каждого ПараметрОтбора Из ПараметрыОтбора Цикл
			ПараметрыЗагрузки.Вставить(ПараметрОтбора.Ключ,ПараметрОтбора.Значение);
		КонецЦикла;
	КонецЕсли;

	ПодготовленныеПараметры.Вставить("ПараметрыЗагрузки",ПараметрыЗагрузки);
   		
	СтрокаПравилКаспер = Новый Структура("Имя,ИмяОтчета,ИмяВариантаОтчета,СКД");	
	СтрокаПравилКаспер.Вставить("Имя",ПараметрыКоманды.ИмяВариантаОтчета);
	СтрокаПравилКаспер.Вставить("ИмяВариантаОтчета",ПараметрыКоманды.ИмяВариантаОтчета);

	Если ПараметрыКоманды.Свойство("ИмяОтчета") Тогда
		СтрокаПравилКаспер.Вставить("ИмяОтчета",ПараметрыКоманды.ИмяОтчета);
	КонецЕсли;
	Если ПараметрыКоманды.Свойство("СКД") Тогда
		СтрокаПравилКаспер.Вставить("СКД",ЗначениеВстрокуВнутр(ПараметрыКоманды.СКД));
	КонецЕсли;
	
	ПравилаЗагрузкиКаспер = Новый Структура();
	ПравилаЗагрузкиКаспер.Вставить(СтрокаПравилКаспер.Имя,СтрокаПравилКаспер);
	ПодготовленныеПараметры.Вставить("ПравилаЗагрузкиКаспер",ПравилаЗагрузкиКаспер);
	
	СтрокаПравилКлиент = Новый Структура("Имя,ИмяОтчета,ИмяВариантаОтчета,СКД");	
	СтрокаПравилКлиент.Вставить("Имя",ПараметрыКоманды.ИмяВариантаОтчета);
	СтрокаПравилКлиент.Вставить("ИмяВариантаОтчета",ПараметрыКоманды.ИмяВариантаОтчета);

	Если ПараметрыКоманды.Свойство("ИмяОтчета") Тогда
		СтрокаПравилКлиент.Вставить("ИмяОтчета",ПараметрыКоманды.ИмяОтчета);
	КонецЕсли;
	Если ПараметрыКоманды.Свойство("СКД") Тогда
		СтрокаПравилКлиент.Вставить("СКД",ЗначениеВстрокуВнутр(ПараметрыКоманды.СКД));
	КонецЕсли;
	
	ПравилаЗагрузкиКлиент = Новый Структура();
	ПравилаЗагрузкиКлиент.Вставить(СтрокаПравилКлиент.Имя,СтрокаПравилКлиент);
	ПодготовленныеПараметры.Вставить("ПравилаЗагрузкиКлиент",ПравилаЗагрузкиКлиент);
	
	СтрокаПравилСервер = Новый Структура();
	СтрокаПравилСервер.Вставить("Имя",ПараметрыКоманды.ИмяКоманды);    
	Если ЗначениеЗаполнено(ПараметрыКоманды.ИмяПроцедуры) Тогда
		СтрокаПравилСервер.Вставить("ИмяПроцедуры",ПараметрыКоманды.ИмяПроцедуры);
	Иначе
		СтрокаПравилСервер.Вставить("ИмяПроцедуры",ПараметрыКоманды.ИмяКоманды);
	КонецЕсли;
	СтрокаПравилСервер.Вставить("ИмяТЗ",ПараметрыКоманды.ИмяВариантаОтчета);
	СтрокаПравилСервер.Вставить("ОчиститьДвижения",Ложь);	
	СтрокаПравилСервер.Вставить("ДополнитьДвижения",Ложь);	
	СтрокаПравилСервер.Вставить("ОперацияНПО",ОперацияНПО);	
	Для Каждого ПараметрЗаполнения Из ПараметрыЗаполнения Цикл
		СтрокаПравилСервер.Вставить(ПараметрЗаполнения.Ключ,ПараметрЗаполнения.Значение);
	КонецЦикла; 
	ПравилаЗагрузкиСервер = Новый Структура();
	ПравилаЗагрузкиСервер.Вставить(СтрокаПравилСервер.Имя,СтрокаПравилСервер);	
	ПодготовленныеПараметры.Вставить("ПравилаЗагрузкиСервер",ПравилаЗагрузкиСервер);
	
	ПодготовленныеПараметры.Вставить("ДополнительныеПараметры",ДополнительныеПараметры);
	ПодготовленныеПараметры.Вставить("ЛогОшибок",Новый Массив);
	
	Возврат ПодготовленныеПараметры;	
	
КонецФункции

Функция УстановитьСрезНаСервере(ПараметрыКоманды, ОперацияНПО, ПараметрыЗаполнения, ПараметрыДанных = Неопределено, ПараметрыОтбора = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПодготовленныеПараметры = ПодготовитьПараметрыЗагрузкиСреза(ПараметрыКоманды, ОперацияНПО, ПараметрыЗаполнения, ПараметрыДанных, ПараметрыОтбора, ДополнительныеПараметры);
	СтрокаТаблицы = Подготовленныепараметры.СтрокаТаблицы;
	ПараметрыЗагрузки = Подготовленныепараметры.ПараметрыЗагрузки;
	ПравилаЗагрузкиКаспер = Подготовленныепараметры.ПравилаЗагрузкиКаспер;
	ПравилаЗагрузкиКлиент = Подготовленныепараметры.ПравилаЗагрузкиКлиент;
	ПравилаЗагрузкиСервер = Подготовленныепараметры.ПравилаЗагрузкиСервер;
	ДополнительныеПараметры = Подготовленныепараметры.ДополнительныеПараметры;
	ЛогОшибок = ПодготовленныеПараметры.ЛогОшибок;

	РезультатЗагрузки = ХМ_ЗагрузкаТЗ_Клиент.ЗагрузитьДокумент(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ПравилаЗагрузкиКлиент, ПравилаЗагрузкиСервер, ДополнительныеПараметры, ЛогОшибок);
	
	Возврат РезультатЗагрузки.Результат;
КонецФункции
	
Функция СформироватьДеревоНаСервере(СхемаКомпоновкиДанных = Неопределено, ПараметрыОтчета, ПараметрыДанных = Неопределено, ПараметрыОтбора = Неопределено) Экспорт

	Если ПараметрыОтчета.Свойство("ТипВозвращаеммогоЗначения") = Ложь Тогда
		ПараметрыОтчета.Вставить("ТипВозвращаеммогоЗначения","ДеревоЗначений");	
	КонецЕсли;

	Если СхемаКомпоновкиДанных = Неопределено Тогда		
		ОтчетДляСКД = Отчеты[ПараметрыОтчета.ИмяОтчета];
		СхемаКомпоновкиДанных = ОтчетДляСКД.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	ИначеЕсли  Ложь Тогда 
		СхемаКомпоновкиДанных = Новый("СхемаКомпоновкиДанных")
	КонецЕсли; 
	
	ИмяВариантаОтчета = ПараметрыОтчета.ИмяВариантаОтчета;
	ИмяДляПрефикса = ПараметрыОтчета.Имя; 
	Если ЛЕВ(ИмяВариантаОтчета,8) = "ПРЕФИКС_" Тогда
		ИмяВариантаОтчета = Сред(ИмяВариантаОтчета,9);		
	КонецЕсли;
	Если ЛЕВ(ИмяДляПрефикса,8) = "ПРЕФИКС_" Тогда
		ИмяДляПрефикса = Сред(ИмяДляПрефикса,9);	
	КонецЕсли;	
	
	ДополнительныеПараметры = Новый Структура("Префикс",ИмяДляПрефикса);	
    	
	НастройкиОтчета = СхемаКомпоновкиДанных.ВариантыНастроек[ИмяВариантаОтчета].Настройки;
	ЗаполнитьНастройкиОтчета(НастройкиОтчета, ПараметрыДанных, ПараметрыОтбора);
	ЗаполнитьНастройкиОтчета(НастройкиОтчета, ПараметрыДанных, ПараметрыОтбора, ДополнительныеПараметры);

	Возврат СформироватьДеревоНаСервереПоНастройке(СхемаКомпоновкиДанных, НастройкиОтчета, ПараметрыОтчета);   

КонецФункции  

Процедура ЗаполнитьНастройкиОтчета(НастройкиОтчета, ПараметрыДанных = Неопределено, ПараметрыОтбора = Неопределено, ДополнительныеПараметры = Неопределено)
	
	Если ПараметрыДанных = Неопределено Тогда
		ПараметрыДанных = Новый Соответствие();		
	КонецЕсли;
	
	Если ПараметрыОтбора = Неопределено Тогда
		ПараметрыОтбора = Новый Соответствие();		
	КонецЕсли;	
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура();		
	КонецЕсли;	


	Для Каждого ПараметрДанных Из ПараметрыДанных Цикл 
		Если ДополнительныеПараметры.Свойство("Префикс") Тогда
			ПараметрДанныхКлюч = ПараметрДанных.Ключ;
			Если ЛЕВ(ПараметрДанныхКлюч,8) = "ПРЕФИКС_" Тогда
				ПараметрДанныхКлюч = Сред(ПараметрДанныхКлюч,9);
			КонецЕсли;
			Ключ = СтрЗаменить(Строка(ПараметрДанныхКлюч),ДополнительныеПараметры.Префикс,"");
		Иначе
			Ключ = ПараметрДанных.Ключ;		
		КонецЕсли;		
		ПараметрДанныхОтчета = НастройкиОтчета.ПараметрыДанных.Элементы.Найти(Ключ);
		Если ПараметрДанныхОтчета = Неопределено Тогда
			Продолжить;		
		КонецЕсли;
		ПараметрДанныхОтчета.Значение = ПараметрДанных.Значение;		
	КонецЦикла;
	
	Для Каждого ПараметрОтбора Из ПараметрыОтбора Цикл
		Для каждого Параметр Из НастройкиОтчета.Отбор.Элементы Цикл
			Если ТипЗнч(Параметр) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				Если ДополнительныеПараметры.Свойство("Префикс") Тогда
					Ключ = СтрЗаменить(Строка(ПараметрОтбора.Ключ),ДополнительныеПараметры.Префикс,"");
				Иначе
					Ключ = ПараметрОтбора.Ключ;		
				КонецЕсли;
				Если Строка(Ключ) = Строка(Параметр.ЛевоеЗначение) Тогда
					Параметр.ПравоеЗначение = ПараметрОтбора.Значение;
					Параметр.Использование = Истина;
				КонецЕсли;
			КонецЕсли;     
		КонецЦикла;        		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьДеревоНаСервереПоНастройке(СхемаКомпоновкиДанных, НастройкиОтчета, ПараметрыОтчета) 

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		

	
	ОбъектВывода  = Новый(ПараметрыОтчета.ТипВозвращаеммогоЗначения);
	Если ПараметрыОтчета.ТипВозвращаеммогоЗначения = "ТабличныйДокумент" Тогда
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ОбъектВывода);
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,НастройкиОтчета
			,,,Тип("ГенераторМакетаКомпоновкиДанных"));
	Иначе
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВывода.УстановитьОбъект(ОбъектВывода);
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,НастройкиОтчета
			,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	КонецЕсли;

	ПроцессорКомпоновкиДанных= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	//ДеревоЗначений;
	
	
	Если Не ПараметрыОтчета.ТипВозвращаеммогоЗначения = "ТабличныйДокумент" Тогда
		Для каждого Параметр Из НастройкиОтчета.ПользовательскиеПоля.Элементы Цикл
			КолонкаДляПереименования = ОбъектВывода.Колонки.Найти(СтрЗаменить(Параметр.ПутьКДанным,".",""));
			Если НЕ КолонкаДляПереименования = Неопределено Тогда
				КолонкаДляПереименования.Имя = Параметр.Заголовок;			
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	Возврат ОбъектВывода;   

КонецФункции

Функция ПолучитьПользовательскиеНастройкиОтчета(Отчет, ПараметрыДанных = Неопределено, ПараметрыОтбора = Неопределено, ПользовательскиеПоля = Неопределено) Экспорт

	НастройкиОтчета = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	Если Не ПараметрыДанных = Неопределено Тогда
		Для каждого Параметр Из НастройкиОтчета.ПараметрыДанных.Элементы Цикл
			Если Параметр.Использование = Истина Тогда
				ПараметрыДанных.Вставить(""+Параметр.Параметр,Параметр.Значение);	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Не ПараметрыОтбора = Неопределено Тогда
		Для каждого Параметр Из НастройкиОтчета.Отбор.Элементы Цикл
			Если ТипЗнч(Параметр) = Тип("ЭлементОтбораКомпоновкиДанных") И Параметр.Использование = Истина Тогда
				ПараметрыОтбора.Вставить(""+Параметр.ЛевоеЗначение,Параметр.ПравоеЗначение);	
			КонецЕсли;     
		КонецЦикла;
	КонецЕсли;
	Если Не ПользовательскиеПоля = Неопределено Тогда
		Для каждого Параметр Из НастройкиОтчета.ПользовательскиеПоля.Элементы Цикл
			ПользовательскиеПоля.Вставить(Параметр.Заголовок,Параметр.ПутьКДанным);
		КонецЦикла;
	КонецЕсли;
	
	Возврат НастройкиОтчета;

КонецФункции

Функция СКД_ВыполнитьПоМеханизмуЗагрузкиV4(Форма,Отчет,ИмяКоманды, ИмяПроцедуры = Неопределено) Экспорт
	
	ОтчетОбъект = Форма.РеквизитФормыВЗначение("Отчет");
	ПараметрыКоманды = Новый Структура("ИмяКоманды,ИмяВариантаОтчета,ИмяПроцедуры");
    ПараметрыКоманды.Вставить("ИмяКоманды",ИмяКоманды); 
	ПараметрыКоманды.Вставить("ИмяВариантаОтчета",Форма.КлючТекущегоВарианта);
	ПараметрыКоманды.Вставить("ИмяПроцедуры",ИмяПроцедуры);
	
	Если Форма.ЗаполнятьСКД Тогда
		ПараметрыКоманды.Вставить("СКД",ОтчетОбъект.СхемаКомпоновкиДанных);
	КонецЕсли;
	ПараметрыКоманды.Вставить("ИмяОтчета",ОтчетОбъект.Метаданные().Имя);

	ОперацияНПО = Отчет.выбОперацияНПО;
 	
    ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("ОчиститьДвижения",Форма.ОчиститьДвижения);
	ПараметрыЗаполнения.Вставить("ДополнитьДвижения",Форма.ДополнитьДвижения);

	ПараметрыДанных = Новый Соответствие();
	ПараметрыОтбора =  Новый Соответствие();	
	ПолучитьПользовательскиеНастройкиОтчета(Отчет, ПараметрыДанных,ПараметрыОтбора);
	
	Настройка_ПараметрыДанных = Новый Структура();
	Если Не ПараметрыДанных.Получить("ДатаНачала") = Неопределено Тогда
		Настройка_ПараметрыДанных.Вставить("ДатаНачала",ПараметрыДанных["ДатаНачала"]);
	КонецЕсли;
	Если Не ПараметрыДанных.Получить("ДатаНачисления") = Неопределено Тогда
		Настройка_ПараметрыДанных.Вставить("ДатаНачисления",ПараметрыДанных["ДатаНачисления"]);
	КонецЕсли;
 	Если Не ПараметрыДанных.Получить("ПериодОтчета") = Неопределено Тогда
		Настройка_ПараметрыДанных.Вставить("ПериодОтчета",ПараметрыДанных["ПериодОтчета"]);
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура();

	ДополнительныеПараметры.Вставить("ТипЗагрузки",Форма.ТипЗагрузки);
	Если Форма.ДобавитьВЕЖ Тогда
		ДополнительныеПараметры.Вставить("ДобавитьВЕЖ");
	КонецЕсли;
	Если Форма.СоздатьМЗ = Истина Тогда
		ДополнительныеПараметры.Вставить("СоздатьМЗ");
	КонецЕсли;
 	Если Форма.ОбновитьВЕЖ = Истина Тогда    
		ДополнительныеПараметры.Вставить("ОбновитьВЕЖ");
	КонецЕсли;

	Возврат хм_МеханизмыСверкиСервер.УстановитьСрезНаСервере(ПараметрыКоманды, ОперацияНПО, ПараметрыЗаполнения, Настройка_ПараметрыДанных, Неопределено, ДополнительныеПараметры);

КонецФункции

Функция СКД_НастроитьИзвлечениеДанных(Форма,Отчет,ИмяТаблицы) Экспорт
	
	ОтчетОбъект = Форма.РеквизитФормыВЗначение("Отчет");
	ПараметрыКоманды = Новый Структура("ИмяКоманды,ИмяВариантаОтчета,ИмяПроцедуры");
    ПараметрыКоманды.Вставить("ИмяКоманды",ИмяТаблицы); 
	ПараметрыКоманды.Вставить("ИмяВариантаОтчета","ПРЕФИКС_"+Форма.КлючТекущегоВарианта);
	
	Если Форма.ЗаполнятьСКД Тогда
		ПараметрыКоманды.Вставить("СКД",ОтчетОбъект.СхемаКомпоновкиДанных);
	КонецЕсли;
	ПараметрыКоманды.Вставить("ИмяОтчета",ОтчетОбъект.Метаданные().Имя);

    ПараметрыЗаполнения = Новый Структура();

	ПараметрыДанных = Новый Соответствие();
	ПараметрыОтбора =  Новый Соответствие();	
	ПолучитьПользовательскиеНастройкиОтчета(Отчет, ПараметрыДанных,ПараметрыОтбора);
	
	Настройка_ПараметрыДанных = Новый Структура();
	Если Не ПараметрыДанных.Получить("ДатаНачала") = Неопределено Тогда
		Настройка_ПараметрыДанных.Вставить("ДатаНачала",ПараметрыДанных["ДатаНачала"]);
	КонецЕсли;
	Если Не ПараметрыДанных.Получить("ДатаНачисления") = Неопределено Тогда
		Настройка_ПараметрыДанных.Вставить("ДатаНачисления",ПараметрыДанных["ДатаНачисления"]);
	КонецЕсли;
 	Если Не ПараметрыДанных.Получить("ПериодОтчета") = Неопределено Тогда
		Настройка_ПараметрыДанных.Вставить("ПериодОтчета",ПараметрыДанных["ПериодОтчета"]);
	КонецЕсли;
 	Если Не ПараметрыОтбора.Получить("ДоговорОПС") = Неопределено Тогда
		Настройка_ПараметрыДанных.Вставить("ДоговорОПС",ПараметрыОтбора["ДоговорОПС"]);
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура();

	ДополнительныеПараметры.Вставить("ТипЗагрузки",Форма.ТипЗагрузки);
	Если Форма.ДобавитьВЕЖ Тогда
		ДополнительныеПараметры.Вставить("ДобавитьВЕЖ");
	КонецЕсли;
	Если Форма.СоздатьМЗ = Истина Тогда
		ДополнительныеПараметры.Вставить("СоздатьМЗ");
	КонецЕсли;
 	Если Форма.ОбновитьВЕЖ = Истина Тогда    
		ДополнительныеПараметры.Вставить("ОбновитьВЕЖ");
	КонецЕсли;
    ДополнительныеПараметры.Вставить("СКД_НастроитьИзвлечениеДанных");
	
	Возврат хм_МеханизмыСверкиСервер.УстановитьСрезНаСервере(ПараметрыКоманды, Неопределено, ПараметрыЗаполнения, Настройка_ПараметрыДанных, Неопределено, ДополнительныеПараметры);

КонецФункции

// -ХМНПФ 27.08.2025 КопыткоАА // http://redmine.npf.com/issues/4564
#КонецОбласти
